// بعدا این مقدار رو برابر با dI باید قرار بدیم
const h = 5; // تعریف ارتفاع دو خط افقی محصورکننده سمبل ها
const r = h / 2; // نصف ارتفاع بیس‌لاین

// تعریف ویوباکس صفحه ادیوگرام
const userXOrigin = -15;
const userYOrigin = -15;
const viewBoxWidth = 170;
const viewBoxHeight = 170;

// عرض صفحه ادیوگرام در واحد پیکسل و ویوباکس
const wp = 700;
// const ratio = 1 / ptv;
const ratio = viewBoxWidth / wp;

// خطوط ادیوگرام
const linesCords = [
  //vertical lines 8 numbers
  { x1: 0, y1: 0, x2: 0, y2: 150 },
  { x1: 20, y1: 0, x2: 20, y2: 150 },
  { x1: 40, y1: 0, x2: 40, y2: 150 },
  { x1: 60, y1: 0, x2: 60, y2: 150 }, //bold line
  { x1: 80, y1: 0, x2: 80, y2: 150 },
  { x1: 100, y1: 0, x2: 100, y2: 150 },

  {x1: 120, y1: 0, x2: 120, y2: 150},
  {x1: 140, y1: 0, x2: 140, y2: 150},
  //horizontal lines 16 numbers
  {x1: 0, y1: 0, x2: 140, y2: 0},
  {x1: 0, y1: 10, x2: 140, y2: 10},
  {x1: 0, y1: 20, x2: 140, y2: 20}, //bold line
  {x1: 0, y1: 30, x2: 140, y2: 30},
  {x1: 0, y1: 40, x2: 140, y2: 40},
  {x1: 0, y1: 50, x2: 140, y2: 50},
  {x1: 0, y1: 60, x2: 140, y2: 60},
  {x1: 0, y1: 70, x2: 140, y2: 70},
  {x1: 0, y1: 80, x2: 140, y2: 80},
  {x1: 0, y1: 90, x2: 140, y2: 90},
  {x1: 0, y1: 100, x2: 140, y2: 100},
  {x1: 0, y1: 110, x2: 140, y2: 110},
  {x1: 0, y1: 120, x2: 140, y2: 120},
  {x1: 0, y1: 130, x2: 140, y2: 130},
  {x1: 0, y1: 140, x2: 140, y2: 140},
  {x1: 0, y1: 150, x2: 140, y2: 150},
];

const svgNS = "http://www.w3.org/2000/svg";

// تعریف مقدار پیش‌فرض سمبل انتخاب شده
let selectedSymbol = ["R_AC", "L_AC"];

//بالایی رو با آبجکت ریفکتور میکنم
let selectedSymbolObj = { R: "R_AC", L: "L_AC" };
let prevSelectedSymbol = { R: "R_AC", L: "L_AC" };

// تعریف آبجکت مختصات ایکس - فرکانس در تیبل ادیوگرام
const xFrequency = {
  // مقدار کلید برابر با مختصات محلی فرکانس هست
  20: 250,
  40: 500,
  53: 750,
  60: 1000,
  73: 1500,
  80: 2000,
  93: 3000,
  100: 4000,
  113: 6000,
  120: 8000,
};
const freqToXObj = {
  // آبجکت تبدیل فرکانس به مختصات ایکس جدول ادیوگرام
  250: 20,
  500: 40,
  750: 53,
  1000: 60,
  1500: 73,
  2000: 80,
  3000: 93,
  4000: 100,
  6000: 113,
  8000: 120,
};
// تعریف آبجکت مختصات ایگرگ - شدت در تیبل ادیوگرام
const yIntensity = {
  5: -15,
  10: -10,
  15: -5,
  20: 0,
  25: 5,
  30: 10,
  35: 15,
  40: 20,
  45: 25,
  50: 30,
  55: 35,
  60: 40,
  65: 45,
  70: 50,
  75: 55,
  80: 60,
  85: 65,
  90: 70,
  95: 75,
  100: 80,
  105: 85,
  110: 90,
  115: 95,
  120: 100,
  125: 105,
  130: 110,
  135: 115,
  140: 120,
  145: 125,
};

const symbolType = [
  "R_AC",
  "R_BC",
  "R_M_AC",
  "R_M_AC",
  "L_AC",
  "L_BC",
  "L_M_AC",
  "L_M_AC",
];

// مقداردهی اولیه مختصات محلی مجاز فعلی
let currentAuthLocal = {
  R: { X: 0, Y: 0 },
  L: { X: 0, Y: 0 },
};

const dI = [
  -15, -10, -5, 0, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75,
  80, 85, 90, 95, 100, 105, 110, 115, 120, 125,
];

// مختصات طولی نقاط مجاز (همه فرکانس‌های اصلی و نیم‌اکتاو)

const dotX = [20, 40, 53, 60, 73, 80, 93, 100, 113, 120];

// مختصات عرضی نقاط مجاز (همه شدت‌های اصلی و نیمه)

const dotY = [
  5, 10, 15, 20, 25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95,
  100, 105, 110, 115, 120, 125, 130, 135, 140, 145,
];

// مختصات نقاط جاگذاری مقادیر تست‌های گفتاری

// آبجکت داده‌های مربوط به ایجاد جدول تمپانوگرام
const tympTableObj = {
  viewBox: "0 0 110 60",
  width: 110,
  height: 60,
  hLinesCord: [
    // مختصات خط‌های افقی از بالا به پایین
    [5, 5, 105, 5],
    [30, 10, 105, 10],
    [30, 15, 105, 15],
    [30, 20, 105, 20],
    [30, 25, 105, 25],
    [5, 30, 105, 30],
    [5, 35, 105, 35],
    [5, 40, 105, 40],
    [5, 45, 105, 45],
    [5, 50, 105, 50],
    [5, 55, 105, 55],
  ],
  vLinesCord: [
    [5, 5, 5, 55],
    [10, 30, 10, 55],
    [15, 30, 15, 55],
    [20, 30, 20, 55],
    [25, 30, 25, 55],
    [30, 5, 30, 55],
    [35, 5, 35, 55],
    [40, 5, 40, 55],
    [45, 5, 45, 55],
    [50, 5, 50, 55],
    [55, 5, 55, 55],
    [60, 5, 60, 55],
    [65, 5, 65, 55],
    [70, 5, 70, 55],
    [75, 5, 75, 55],
    [80, 5, 80, 55],
    [85, 5, 85, 55],
    [90, 5, 90, 55],
    [95, 5, 95, 55],
    [100, 5, 100, 55],
    [105, 5, 105, 55],
  ],
  hAxis: [
    // کپشن های محور افقی
    [5, 58, "-600"],
    [15, 58, "-500"],
    [25, 58, "-400"],
    [35, 58, "-300"],
    [45, 58, "-200"],
    [55, 58, "-100"],
    [65, 58, "0"],
    [75, 58, "+100"],
    [85, 58, "+200"],
    [95, 58, "+300"],
    [105, 58, "+400"],
  ],
  vAxis: [
    [4, 51, "0.2"],
    [4, 46, "0.4"],
    [4, 41, "0.6"],
    [4, 36, "0.8"],
    [4, 31, "1.0"],
    [4, 26, "1.2"],
    [4, 21, "1.4"],
    [4, 16, "1.6"],
    [4, 11, "1.8"],
    [4, 6, "2.0"],
  ],
  label: [
    [10, 10, "Type:"],
    [10, 17, "ECV:"],
    [10, 22, "SC:"],
    [10, 27, "MEP:"],
  ],
};

export {
  wp,
  h,
  r,
  linesCords,
  svgNS,
  selectedSymbolObj,
  prevSelectedSymbol,
  xFrequency,
  yIntensity,
  freqToXObj,
  symbolType,
  currentAuthLocal,
  userXOrigin,
  viewBoxWidth,
  ratio,
  userYOrigin,
  viewBoxHeight,
  dI,
  dotX,
  dotY,
  tympTableObj,
};
